<?php
echo '<h1>みなさん' . PHP_EOL . 'こんにちは</h1>';
?>

<?='今日は\'良い天気\'ですね'?>

<?php

/* <p><?='この行だけをまとめてコメントする' ?></p>*/
?>


<!-- echo = 10; // 代入
echo $a = 10; // 代入出力
echo $10; // 変数出力
echo 1 0; // 半角空き
echo １０; // 全角数字
echo 1.0; // 小数点
echo 1,0; // カンマ区切り
echo '1'.'0'; // 文字列結合
echo 1 + '0'; // 文字列加算
echo '11' - '1'; // 文字列減算
echo (10); // 丸括弧
echo [10]; // ブラケット
echo {10}; // 波括弧
echo {$a = 10}; // 代入波括弧
echo $a == 10; // 等価演算子
echo $a += 10; // 複合演算子
$a = 10; echo '$a'; // 変数文字列
$a = 10; echo($a); // 変数丸括弧 -->